# Task 1.1
lc = [str(i+1) for i in range(20)]
print(f'Task 1.1 (List comp.):\n{lc}')

# Task 1.2
task_ex = ['кит', 'кот', 'крот']
lc = [f'{count} {i}' for count, i in enumerate(task_ex)]
print(f'Task 1.2 (List comp.):\n{lc}')

task_ex = ['кит', 'кот', 'крот', 'рот', 'рок', 'корт']
lc = [f'{count} {i}' for count, i in enumerate(task_ex)]
print(f'Task 1.2 (List comp.):\n{lc}')

#Task 1.3
task_ex = ['кит', 'кот', 'крот']
lc = [f'{count} {i}' for count, i in enumerate(task_ex) if len(i) <= 3]
print(f'Task 1.3 (List comp.):\n{lc}')

task_ex = ['кит', 'кот', 'крот', 'рот', 'рок', 'корт']
lc = [f'{count} {i}' for count, i in enumerate(task_ex) if len(i) <= 3]
print(f'Task 1.3 (List comp.):\n{lc}')

#Task 1.4
task_ex = ['111', 'cat', 'got', 'ddd', '222']
lc = [i for i in task_ex if i.isdigit()]
print(f'Task 1.4 (List comp.):\n{lc}')


#Task 1.5
task_ex = ['111', 'cat', 'got', 'ddd', '222']
lc = [i for i, j in enumerate(task_ex) if j.isdigit()]
print(f'Task 1.5 (List comp.):\n{lc}')

#Task 1.6
task_ex = ['111', 'cat', 'got', 'ddd', '222']
lc = [(i, j) for i, j in enumerate(task_ex) if j.isdigit()]
print(f'Task 1.6 (List comp.):\n{lc}')

#Task 1.7
task_ex = ['044 225 73 39', '099 116 30 87', '094 129 81 69', '094 127 04 85', '044 222 74 33', '044 353 55 31', '097 921 27 09', '094 550 50 02', '044 362 96 00', '097 853 55 81', '097 120 95 90', '099 752 22 97', '050 761 49 45', '094 497 75 09', '094 498 89 53', '094 496 13 91', '094 497 35 13', '094 497 75 69', '050 063 52 97', '050 530 97 71', '044 227 16 63', '056 785 55 19', '068 450 69 13', '097 001 42 67', '096 097 58 16', '094 497 34 37', '094 097 12 17', '094 497 75 69', '097 497 75 97', '094 497 34 85', '094 496 52 54']
lc = [i for i in task_ex if i[:3] == '097']
print(f'Task 1.7 (List comp.):\n{lc}')


#Task 1.8
task_ex = ['044 225 73 39', '099 116 30 87', '094 129 81 69', '094 127 04 85', '044 222 74 33', '044 353 55 31', '097 921 27 09', '094 550 50 02', '044 362 96 00', '097 853 55 81', '097 120 95 90', '099 752 22 97', '050 761 49 45', '094 497 75 09', '094 498 89 53', '094 496 13 91', '094 497 35 13', '094 497 75 69', '050 063 52 97', '050 530 97 71', '044 227 16 63', '056 785 55 19', '068 450 69 13', '097 001 42 67', '096 097 58 16', '094 497 34 37', '094 097 12 17', '094 497 75 69', '097 497 75 97', '094 497 34 85', '094 496 52 54']
lc = [i for i in task_ex if i[:3] == '097' or i[:3] == '050']
print(f'Task 1.8 (List comp.):\n{lc}')

#Task 1.9
task_ex = ['044 225 73 39', '099 116 30 87', '094 129 81 69', '094 127 04 85', '044 222 74 33', '044 353 55 31', '097 921 27 09', '094 550 50 02', '044 362 96 00', '097 853 55 81', '097 120 95 90', '099 752 22 97', '050 761 49 45', '094 497 75 09', '094 498 89 53', '094 496 13 91', '094 497 35 13', '094 497 75 69', '050 063 52 97', '050 530 97 71', '044 227 16 63', '056 785 55 19', '068 450 69 13', '097 001 42 67', '096 097 58 16', '094 497 34 37', '094 097 12 17', '094 497 75 69', '097 497 75 97', '094 497 34 85', '094 496 52 54']
lc = [f'+38{i.replace(" ", "")}' for i in task_ex if i[:3] == '097' or i[:3] == '050']
print(f'Task 1.9 (List comp.):\n{lc}')